[
  {
    "id": 2,
    "projectName": "Ecommerce",
    "bannerTitle": "Full-Featured Multi-Vendor E-commerce Platform",
    "bannerDescription": "Everything you need to sell online — built with speed, usability, and flexibility in mind.This custom-built e-commerce system is designed to make online shopping smooth for customers and effortless for store owners. From product browsing to order tracking, it covers every step of the buying journey—while giving admins full control over the business backend. Whether you’re a solo store owner or managing a marketplace with dozens of vendors, this platform adapts to your needs.",
    "bannerImg": "/images/portfolio/Ecommerce/home/ecommerce_banner.jpg",
    "projectDetails": [
      {
        "home": [
          "/images/portfolio/Ecommerce/home/ecommerce_home_full.png",
          "/images/portfolio/Ecommerce/home/ecommerce_home_1.png",
          "/images/portfolio/Ecommerce/home/chat.png"
        ]
      },
      {
        "features": [
          "/images/portfolio/Ecommerce/feature/product_details.png",
          "/images/portfolio/Ecommerce/feature/cart.png",
          "/images/portfolio/Ecommerce/feature/my_order.png"
        ],
        "featuresDescription": [
          {
            "subtitle": "Smart Product Search",
            "details": "Find what you need quickly. Filter by category — Men’s/Women’s Fashion, Electronics, Footwear, and more."
          },
          {
            "subtitle": "Seamless Cart & Checkout",
            "details": "A smooth, user-friendly cart and checkout process with item tracking and secure payment flow."
          },
          {
            "subtitle": "Secure Payment Gateway Integration",
            "details": "Integrated with local and global payment gateways like bKash, Nagad, Visa, and Mastercard."
          },
          {
            "subtitle": "Order Tracking & Returns",
            "details": "Customers can easily track their orders, request returns, or re-order from their own dashboard."
          }
        ]
      },
      {
        "dashboard": [
          "/images/portfolio/Ecommerce/dashboard/all_product.png",
          "/images/portfolio/Ecommerce/dashboard/all_order.png",
          "/images/portfolio/Ecommerce/dashboard/add_product.png"
        ],
        "dashboardDescription": [
          {
            "subtitle": "Real-Time Inventory Management",
            "details": "Track stock levels, manage product availability, and avoid overselling with dynamic inventory updates."
          },
          {
            "subtitle": "Centralized Admin Control Panel",
            "details": "Manage products, categories, customers, and orders all from a single, intuitive dashboard."
          },
          {
            "subtitle": "Order & Customer Analytics",
            "details": "View key metrics to understand sales trends, customer behavior, and overall store performance."
          },
          {
            "subtitle": "Customer Support Handling",
            "details": "Handle customer queries, returns, and feedback efficiently with built-in support tools."
          }
        ]
      }
    ]
  },
  {
    "id": 3,
    "projectName": "Bright Gadget",
    "bannerTitle": "Bright Gadget – Modern Gadget E-commerce Store",
    "bannerDescription": "Bright Gadget is a sleek, high-performance single-vendor e-commerce platform designed for selling gadgets, electronics, and smart accessories. Built with user-friendly navigation, lightning-fast product browsing, and secure checkout, this platform offers a smooth shopping experience tailored for tech enthusiasts. From mobile devices and headphones to cutting-edge gadgets, Bright Gadget provides a visually engaging and reliable solution for online gadget stores.",
    "bannerImg": "/images/portfolio/BrightGadget/home/brightgadget_banner_1.png",
    "projectDetails": [
      {
        "home": [
          "/images/portfolio/BrightGadget/home/gadget_home_1.png",
          "/images/portfolio/BrightGadget/home/gadget_home_2.png",
          "/images/portfolio/BrightGadget/home/gadget_home_3.png"
        ]
      },
      {
        "features": [
          "/images/portfolio/BrightGadget/feature/feature_1.png",
          "/images/portfolio/BrightGadget/feature/feature_2.png",
          "/images/portfolio/BrightGadget/feature/feature_3.png",
          "/images/portfolio/BrightGadget/feature/feature_4.png",
          "/images/portfolio/BrightGadget/feature/feature_5.png"
        ],
        "featuresDescription": [
          {
            "subtitle": "⚡ Fast Gadget Browsing",
            "details": "Optimized product listing and smart filtering for categories like mobiles, laptops, headphones, and accessories."
          },
          {
            "subtitle": "🔐 Secure Checkout Process",
            "details": "Streamlined cart and checkout system with safe and reliable payment integrations for worry-free transactions."
          },
          {
            "subtitle": "📱 Responsive & Modern Design",
            "details": "Mobile-first design ensures smooth shopping across smartphones, tablets, and desktops."
          }
        ]
      },
      {
        "dashboard": [
          "/images/portfolio/BrightGadget/dashboard/dashboard_1.png",
          "/images/portfolio/BrightGadget/dashboard/dashboard_2.png",
          "/images/portfolio/BrightGadget/dashboard/dashboard_3.png",
          "/images/portfolio/BrightGadget/dashboard/dashboard_4.png"
        ],
        "dashboardDescription": [
          {
            "subtitle": "📦 Product & Inventory Management",
            "details": "Easily add, edit, and manage gadgets with real-time stock updates and low-inventory alerts."
          },
          {
            "subtitle": "🛍️ Order Tracking Dashboard",
            "details": "Monitor all orders, payment statuses, and delivery updates from a single admin panel."
          },
          {
            "subtitle": "👨‍💻 Customer Management",
            "details": "Track customer details, purchase history, and support requests to improve retention."
          },
          {
            "subtitle": "📊 Sales Reports & Analytics",
            "details": "Gain insights into top-selling gadgets, revenue growth, and customer buying behavior with detailed reports."
          }
        ]
      }
    ]
  },
  {
    "id": 4,
    "projectName": "Hexatech",
    "bannerTitle": "Hexatech – All-in-One Business Suite",
    "bannerDescription": "Hexatech is an advanced, all-in-one CRM and business automation platform developed. Designed to streamline operations for modern businesses, it features over 30 powerful modules including inventory management, project tracking, task automation, email campaigns, analytics, scheduling, team collaboration, and more. Whether it's managing contacts, launching marketing campaigns, or generating custom reports, Hexatech brings everything under one smart, intuitive interface. With its scalable design and sleek UI, Hexatech is a complete solution for businesses seeking efficiency and growth through seamless digital transformation.",
    "bannerImg": "/images/portfolio/Hexatech/home/hexatech_home.png",
    "projectDetails": [
      {
        "home": [
          "/images/portfolio/Hexatech/home/hexatech_home.png",
          "/images/portfolio/Hexatech/home/home.png",
          "/images/portfolio/Hexatech/home/workflow_hero.png"
        ]
      },
      {
        "features": [
          "/images/portfolio/Hexatech/feature/scheduler.png",
          "/images/portfolio/Hexatech/feature/spreadsheets.png",
          "/images/portfolio/Hexatech/feature/docs.png",
          "/images/portfolio/Hexatech/feature/workflow_data.png"
        ],
        "featuresDescription": [
          {
            "subtitle": "Real-Time Analytics & Monitoring",
            "details": "Our platform provides live data insights and performance monitoring, empowering businesses to make informed decisions quickly. The intuitive dashboard offers a clear overview of key metrics and trends."
          },
          {
            "subtitle": "Collaborative Document Editor",
            "details": "A powerful, in-built text editor allows multiple users to collaborate on documents simultaneously. This feature streamlines workflows, centralizes project files,and enhances team communication."
          },
          {
            "subtitle": "Integrated Scheduling & Task Management",
            "details": "The dynamic calendar and task manager simplify project planning and team coordination. Users can schedule events and manage deadlines directly within the application, ensuring seamless project execution."
          },
          {
            "subtitle": "Visualized Idea Mapping",
            "details": "Our mind-mapping tool enables teams to visually brainstorm and organize complex ideas. This feature transforms strategic planning by offering a clear and interactive way to develop and share concepts."
          }
        ]
      },
      {
        "dashboard": [
          "/images/portfolio/Hexatech/dashboard/dashboard_1.png",
          "/images/portfolio/Hexatech/dashboard/dashboard_2.png"
        ],
        "dashboardDescription": [
          {
            "subtitle": "Comprehensive Data Visualization",
            "details": "The platform features an advanced dashboard with dynamic charts and graphs. These tools transform complex data into clear, actionable visual insights, making it easy for users to monitor progress and identify trends."
          },
          {
            "subtitle": "Team and Resource Management",
            "details": "An at-a-glance overview shows a company's total applications, projects, and team members. This feature provides a centralized hub for managing resources and tracking key operational metrics efficiently."
          },
          {
            "subtitle": "Performance Monitoring Dashboard",
            "details": "Users can track various performance indicators through dedicated widgets and graphs. This customized dashboard provides a holistic view of the company's health, helping to measure success and pinpoint areas for improvement."
          },
          {
            "subtitle": "Customizable Reporting",
            "details": "The project offers flexible reporting tools that allow users to generate detailed reports based on their specific needs. This functionality provides a deeper understanding of business performance and supports strategic decision-making."
          }
        ]
      }
    ]
  },
  {
    "id": 5,
    "projectName": "ASON",
    "bannerTitle": "ASON AI — Powerful AI-driven Platform",
    "bannerDescription": "ASON AI is a powerful AI-driven platform designed to revolutionize content creation, task automation, and intelligent interactions. From generating high-quality audio and video to engaging in prompt-based AI conversations and deploying specialized AI agents, ASON AI brings a wide array of advanced artificial intelligence technologies into a single, user-friendly platform. Whether you're a creator, a business team, or a developer looking to integrate AI into your workflow, ASON AI provides a modular, intuitive platform that combines the strength of modern AI models with tools that anyone can use—no deep tech knowledge required.",
    "bannerImg": "/images/portfolio/Ason/home/ason_banner.png",
    "projectDetails": [
      {
        "home": [
          "/images/portfolio/Ason/home/chat.png",
          "/images/portfolio/Ason/home/chat-2.png",
          "/images/portfolio/Ason/home/chat-3.png"
        ]
      },
      {
        "features": [
          "/images/portfolio/Ason/feature/models.png",
          "/images/portfolio/Ason/feature/connectors.png",
          "/images/portfolio/Ason/feature/agents.png"
        ],
        "featuresDescription": [
          {
            "subtitle": "Seamless Multi-Model Integration",
            "details": "Asonai combines powerful AI models like Gemini, Grok, and more — enabling users to switch and utilize different intelligence engines based on task-specific needs."
          },
          {
            "subtitle": "Smart Social Platform Connectors",
            "details": "Easily integrate Gmail, Facebook, Twitter, and other platforms. Asonai’s connectors allow real-time interaction, content generation, and communication from a single workspace."
          },
          {
            "subtitle": "Built-in Intelligent Agents",
            "details": "Asonai comes equipped with specialized agents for coding, image generation, real-time web search, and virtual desktop environments — all accessible instantly."
          }
        ]
      },
      {
        "dashboard": [
          "/images/portfolio/Ason/dashboard/transaction.png",
          "/images/portfolio/Ason/dashboard/traffic.png",
          "/images/portfolio/Ason/dashboard/dashboard.png"
        ],
        "dashboardDescription": [
          {
            "subtitle": "User Insights Dashboard",
            "details": "Track user growth, behavior patterns, and activity in real-time through interactive charts and statistics."
          },
          {
            "subtitle": "Traffic Analytics",
            "details": "Monitor traffic sources, peak usage timeframes, device-type breakdowns, and region-based access to optimize reach."
          },
          {
            "subtitle": "Transactions & Revenue Reports",
            "details": "View all transactions in detailed tables and visual summaries — including successful payments, expirations, and total revenue analytics for better decision-making."
          }
        ]
      }
    ]
  },
  {
    "id": 6,
    "projectName": "TIKR SMBL",
    "bannerTitle": "Ticker Smbl — Everything You Need to Decode the Markets",
    "bannerDescription": "Ticker Smbl is a next-generation financial research platform built for traders, investors, and analysts who demand more than just data.  Built for clarity, speed, and depth, Ticker Smbl combines the power of advanced analytics, clean UI, and comprehensive market data to give you an edge in every decision you make. We cover everything that moves the markets — and help you understand why. From macro trends to micro insights, Ticker Smbl distills complex data into actionable signals.",
    "bannerImg": "/images/portfolio/Tiker_SMBL/home/home_1.png",
    "projectDetails": [
      {
        "home": [
          "/images/portfolio/Tiker_SMBL/home/hexatech_home.png",
          "/images/portfolio/Tiker_SMBL/home/home.png",
          "/images/portfolio/Tiker_SMBL/home/workflow_hero.png"
        ]
      },
      {
        "features": [
          "/images/portfolio/Tiker_SMBL/feature/portfolio.png",
          "/images/portfolio/Tiker_SMBL/feature/stock.png",
          "/images/portfolio/Tiker_SMBL/feature/news.png",
          "/images/portfolio/Tiker_SMBL/feature/chatbot.png"
        ],
        "featuresDescription": [
          {
            "subtitle": "Portfolio Management",
            "details": "Track your holdings across multiple accounts and asset classes. Analyze performance in real-time and make informed decisions with visual insights and trend comparisons."
          },
          {
            "subtitle": "Stock & Market Data",
            "details": "Access real-time stock quotes, price alerts, fundamental data, and technical indicators. From individual equities to sector overviews, everything is covered."
          },
          {
            "subtitle": "AI Market Assistant",
            "details": "Chat with an intelligent AI to get news summaries, earnings previews, market forecasts, and custom stock analysis in seconds."
          }
        ]
      },
      {
        "dashboard": [
          "/images/portfolio/Tiker_SMBL/dashboard/dashboard_1.png",
          "/images/portfolio/Tiker_SMBL/dashboard/earning.png",
          "/images/portfolio/Tiker_SMBL/dashboard/history.png"
        ],
        "dashboardDescription": [
          {
            "subtitle": "Advanced Trading Dashboard",
            "details": "Experience charting like never before — over 100+ indicators, customizable layouts, strategy backtesting, and multi-chart views for power users."
          },
          {
            "subtitle": "Earnings & Historical Insights",
            "details": "Access complete earnings history, analyst expectations, and past performance to understand how companies behave through different market cycles."
          },
          {
            "subtitle": "Smart Alerts & Watchlists",
            "details": "Create dynamic watchlists and set real-time alerts on price, volume, RSI, or news triggers. Never miss an opportunity again."
          }
        ]
      }
    ]
  },
  {
    "id": 7,
    "projectName": "Payment",
    "bannerTitle": "Make Your Payment Secure and Easy",
    "bannerDescription": "Payment is a next-generation mobile payment gateway built for individuals, businesses, and merchants who need fast, secure, and reliable digital transactions. From sending money to friends and family, paying bills, recharging mobile balance, or shopping online, Payment makes every step simple and safe. With powerful encryption, instant transfer speed, and an easy-to-use interface, Payment helps you manage money anytime, anywhere. Whether you are a small shop owner or a regular user, Payment brings financial freedom to your fingertips with the trust you deserve.",
    "bannerImg": "/images/portfolio/Payment_Mobile_APP/home/home_1.png",
    "projectDetails": [
      {
        "home": [
          "/images/portfolio/Payment_Mobile_APP/home/home_1.png",
          "/images/portfolio/Payment_Mobile_APP/home/home_2.png",
          "/images/portfolio/Payment_Mobile_APP/home/home_3.png"
        ]
      },
      {
        "features": [
          "/images/portfolio/Payment_Mobile_APP/feature/feature_4.png",
          "/images/portfolio/Payment_Mobile_APP/feature/feature_5.png",
          "/images/portfolio/Payment_Mobile_APP/feature/feature_1.png",
          "/images/portfolio/Payment_Mobile_APP/feature/feature_6.png"
        ],
        "featuresDescription": [
          {
            "subtitle": "Instant Money Transfer",
            "details": "Transfer money instantly to any account or mobile number within seconds. Payment ensures fast, reliable, and 100% secure transactions."
          },
          {
            "subtitle": "Bill Payments & Recharge",
            "details": "Easily pay electricity, gas, water, and internet bills. Recharge mobile balance or data packs anytime without waiting in line."
          },
          {
            "subtitle": "Merchant & Online Payments",
            "details": "Make cashless payments at shops, restaurants, and e-commerce sites using QR code or merchant checkout with complete safety."
          },
          {
            "subtitle": "Advanced Security",
            "details": "Protect your money with end-to-end encryption, multi-step authentication, and real-time fraud monitoring for peace of mind."
          }
        ]
      },
      {
        "dashboard": [
          "/images/portfolio/Payment_Mobile_APP/dashboard/Dashboard_11.png",
          "/images/portfolio/Payment_Mobile_APP/dashboard/Dashboard_2.png",
          "/images/portfolio/Payment_Mobile_APP/dashboard/Dashboard_3.png"
        ],
        "dashboardDescription": [
          {
            "subtitle": "Smart Dashboard",
            "details": "View your balance, recent transactions, and expense summary in one place. Designed for simplicity with powerful features for everyone."
          },
          {
            "subtitle": "Transaction Insights",
            "details": "Analyze your spending habits with categorized reports and visual insights. Stay in control of where your money goes."
          },
          {
            "subtitle": "Custom Alerts & Notifications",
            "details": "Get real-time notifications for every transaction, reminders for bills, and alerts for offers so you never miss an opportunity."
          },
          {
            "subtitle": "Income & Expense Tracking",
            "details": "Monitor your income sources and daily expenses side by side. The system automatically organizes your cash flow, helping you maintain a clear financial picture."
          }
        ]
      }
    ]
  },
  {
    "id": 8,
    "projectName": "4takeaway",
    "bannerTitle": "Delicious Dining, Simplified Management",
    "bannerDescription": "4takeaway is an all-in-one solution for restaurants, cafés, and food businesses. From showcasing your menu to managing orders and clients, it brings your entire restaurant online. Let guests explore dishes, book tables, and order with ease, while you track everything from a powerful dashboard. Designed for speed, security, and great user experience, it helps you serve customers better and grow your business effortlessly.",
    "bannerImg": "/images/portfolio/resturant_1/home/home_10.png",
    "projectDetails": [
      {
        "home": [
          "/images/portfolio/resturant_1/home/home_3.png",
          "/images/portfolio/resturant_1/home/home_2.png",
          "/images/portfolio/resturant_1/home/home_4.png"
        ]
      },
      {
        "features": [
          "/images/portfolio/resturant_1/feature/feature_menu.png",
          "/images/portfolio/resturant_1/feature/feature_menu_details.png",
          "/images/portfolio/resturant_1/feature/feature_order.png"
        ],
        "featuresDescription": [
          {
            "subtitle": "Interactive Menu",
            "details": "Present your dishes with high-quality images, pricing, and descriptions. Customers can browse easily and get inspired to order."
          },
          {
            "subtitle": "Detailed Menu Pages",
            "details": "Highlight ingredients, portion sizes, allergens, and chef notes for each item, giving diners clarity before ordering."
          },
          {
            "subtitle": "Quick Ordering System",
            "details": "Customers can add items to cart, customize dishes, and place orders in seconds — ideal for both dine-in and takeaway."
          }
        ]
      },
      {
        "dashboard": [
          "/images/portfolio/resturant_1/dashboard/dashboard.png",
          "/images/portfolio/resturant_1/dashboard/dashboard_orders.png",
          "/images/portfolio/resturant_1/dashboard/dashboard_clients.png"
        ],
        "dashboardDescription": [
          {
            "subtitle": "Smart Dashboard",
            "details": "Monitor sales, reservations, and order trends in one intuitive view. Get a complete picture of your restaurant’s performance."
          },
          {
            "subtitle": "Order Management",
            "details": "Track incoming, in-progress, and completed orders in real time. Keep your kitchen and service staff perfectly synchronized."
          },
          {
            "subtitle": "Client Records & Insights",
            "details": "Store customer details, preferences, and order history to personalize experiences and build loyalty."
          }
        ]
      }
    ]
  },
  {
    "id": 1,
    "projectName": "Asian Food",
    "bannerTitle": "Asian Food – Smart Restaurant & Food Delivery Platform",
    "bannerDescription": "Asian Food is a modern restaurant and food delivery web application designed to make ordering and managing meals effortless. With an elegant menu, fast checkout, and a powerful admin dashboard, it helps restaurants present their dishes online, handle orders, and grow their customer base with ease. Built with clean code and responsive design, it delivers a seamless experience for both users and administrators.",
    "bannerImg": "/images/portfolio/asian_food/home/home_10.png",
    "projectDetails": [
      {
        "home": [
          "/images/portfolio/asian_food/home/home.png",
          "/images/portfolio/asian_food/home/home_2.png",
          "/images/portfolio/asian_food/home/home_3.png"
        ]
      },
      {
        "features": [
          "/images/portfolio/asian_food/feature/feature_menu.png",
          "/images/portfolio/asian_food/feature/feature_menu_details.png",
          "/images/portfolio/asian_food/feature/feature_city_order.png"
        ],
        "featuresDescription": [
          {
            "subtitle": "Interactive Menu",
            "details": "Showcase delicious dishes with clear photos, prices, and descriptions. Customers can explore items and choose what they love most."
          },
          {
            "subtitle": "Menu Details",
            "details": "Provide full information about ingredients, portion sizes, and preparation style, helping users make confident choices."
          },
          {
            "subtitle": "Featured Orders by City",
            "details": "Highlight popular meals in different cities, encouraging users to discover top-rated items available in their area."
          }
        ]
      },
      {
        "dashboard": [
          "/images/portfolio/asian_food/dashboard/dashboard_main.png",
          "/images/portfolio/asian_food/dashboard/dashboard_restaurants.png",
          "/images/portfolio/asian_food/dashboard/dashboard_subscription.png"
        ],
        "dashboardDescription": [
          {
            "subtitle": "Comprehensive Dashboard",
            "details": "View key metrics, order stats, and restaurant performance in one place. The dashboard is built for clarity and efficiency."
          },
          {
            "subtitle": "Restaurant Management",
            "details": "Add, edit, or organize restaurants with ease. Keep your platform updated and well-structured for a professional look."
          },
          {
            "subtitle": "Subscription & Access Control",
            "details": "Manage subscription plans and user permissions to ensure smooth operations and secure platform access."
          }
        ]
      }
    ]
  }
]
